'''

'''
import modules.player_step as m_step
def click_cell(x, y):
    # умова яка відповідає за координати першого рядка
    if y > 0 and y < 100:
        # умова яка відповідає за координати першої комірки
        if x > -100 and x < 0:
            m_step.whos_turn(-100, 100, 0)
        # умова яка відповідає за координати другої комірки
        elif x > 0 and x < 100:
            m_step.whos_turn(0, 100, 1)
        # умова яка відповідає за координати третьої комірки
        elif x > 100 and x < 200:
            m_step.whos_turn(100, 100, 2)
    # умова яка відповідає за координати другого рядка
    elif y < 0 and y > -100:
        # умова яка відповідає за координати першої комірки
        if x > -100 and x < 0:
            m_step.whos_turn(-100, 0, 3)
        # умова яка відповідає за координати другої комірки
        elif x > 0 and x < 100:
            m_step.whos_turn(0, 0, 4)
        # умова яка відповідає за координати третьої комірки
        elif x > 100 and x < 200:
            m_step.whos_turn(100, 0, 5)
    # умова яка відповідає за координати третього рядка
    elif y < -100 and y > -200:
        if x > -100 and x < 0:
            m_step.whos_turn(-100, -100, 6)
        elif x > 0 and x < 100:
            m_step.whos_turn(0, -100, 7)
        elif x > 100 and x < 200:
            m_step.whos_turn(100, -100, 8)